app/controllers/posts_controller.rb

  def create
    if params.require(:post)[:image].present?
---
SELECT "posts".* FROM "posts" ORDER BY "posts"."created_at" DESC

    def set_post
      @post = Post.find(params[:id])
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? ORDER BY "posts"."created_at" DESC LIMIT ?  [["id", 980190962], ["LIMIT", 1]]